PWS/HWs/Project/BookStoreComposite2/test/FoundButCannotShip/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="BookStoreComposite2">
  <soapenv:Body>
    <book:ClientCompositeOperation>
      <username>user3</username>
      <password>pass3</password>
      <bookSearchTerm>111</bookSearchTerm>
      <creditCardNumber>123456787654</creditCardNumber>
    </book:ClientCompositeOperation>
  </soapenv:Body>
</soapenv:Envelope>