trunk/PWS/HWs/Project/BookStoreComposite2/test/BuyFromSwedenAndDoNotShipIt/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="BookStoreComposite2">
  <soapenv:Body>
    <book:ClientCompositeOperation>
      <username>user2</username>
      <password>pass2</password>
      <bookSearchTerm>222</bookSearchTerm>
      <creditCardNumber>123456789876543</creditCardNumber>
    </book:ClientCompositeOperation>
  </soapenv:Body>
</soapenv:Envelope>